app/controllers/comments_controller.rb

	def create
		@post = Post.find(params[:post_id])
			@comment = @post.comments.create(comments_params)
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 32]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Este é um comentário de teste"], ["commenter", "Thiago Capeleiro"], ["created_at", "2014-12-09 17:18:23.886999"], ["post_id", 32], ["updated_at", "2014-12-09 17:18:23.886999"]]

	def destroy
		@post = Post.find(params[:post_id])
		@comment = @post.comments.find(params[:id])
		@comment.destroy
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 32]]
SELECT  "comments".* FROM "comments"  WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT 1  [["post_id", 32], ["id", 2]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]