app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
	def index
		@fetch_posts = Post.all