app/controllers/posts_controller.rb

	def create
		# render plain: params[:posts].inspect
		@post = Post.new(post_params)
		if @post.save
---
INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-12-08 14:50:12.057562"], ["text", "dasd"], ["title", "asd"], ["updated_at", "2014-12-08 14:50:12.057562"]]

	def show
		@fetch_post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 5]]

	def index
		if params[:items]
			per_page = params[:items]
		else
			per_page = 25
		end
		@fetch_posts = Post.order('created_at ASC').page(params[:page]).per(per_page)
---
SELECT  "posts".* FROM "posts"   ORDER BY created_at ASC LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "posts"